# RebarQuanityByDistrib Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RebarQuanityByDistrib Property
ParameterTypeId Class See Also
---
"Quantity By Rebar Set"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RebarQuanityByDistrib { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RebarQuanityByDistrib As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RebarQuanityByDistrib {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace